{"index":{"_id":1}}
{"title":"Fast and Easy Pasta With Blistered Cherry Tomato Sauce","description":"Cherry tomatoes are almost always sweeter, riper, and higher in pectin than larger tomatoes at the supermarket. All of these factors mean that cherry tomatoes are fantastic for making a rich, thick, flavorful sauce. Even better: It takes only four ingredients and about 10 minutes, start to finish — less time than it takes to cook the pasta you're gonna serve it with.","preparation_time_minutes":12,"servings":{"min":4,"max":6},"steps":["Place pasta in a large skillet or sauté pan and cover with water and a big pinch of salt. Bring to a boil over high heat, stirring occasionally. Boil until just shy of al dente, about 1 minute less than the package instructions recommend.","Meanwhile, heat garlic and 4 tablespoons (60ml) olive oil in a 12-inch skillet over medium heat, stirring frequently, until garlic is softened but not browned, about 3 minutes. Add tomatoes and cook, stirring, until tomatoes begin to burst. You can help them along by pressing on them with the back of a wooden spoon as they soften.","Continue to cook until sauce is rich and creamy, about 5 minutes longer. Stir in basil and season to taste with salt and pepper.","When pasta is cooked, drain, reserving 1 cup of pasta water. Add pasta to sauce and increase heat to medium-high. Cook, stirring and tossing constantly and adding reserved pasta water as necessary to adjust consistency to a nice, creamy flow. Remove from heat, stir in remaining 2 tablespoons (30ml) olive oil, and grate in a generous shower of Parmesan cheese. Serve immediately, passing extra Parmesan at the table."],"ingredients":[{"name":"Dry pasta","amount":450,"unit":"grams"},{"name":"Kosher salt"},{"name":"Cloves garlic","amount":4,"unit":"pcs"},{"name":"Extra-virgin olive oil","amount":90,"unit":"ml"},{"name":"Cherry tomatoes","amount":750,"unit":"grams"},{"name":"Fresh basil leaves","amount":30,"unit":"grams"},{"name":"Freshly ground black pepper"},{"name":"Parmesan cheese"}],"created":"2017-03-29T14:43:21Z","ratings":[4.5,5.0,3.0,4.5]}
{"index":{"_id":2}}
{"title":"Pasta With Butternut Squash and Sage Brown Butter","description":"Brown butter-based pasta sauces are some of the simplest things around. They're emulsions made with a flavorful fat and pasta cooking water that coats the pasta in a thin, creamy sheen of flavor. Throw in some sautéd squash and some sage and you've got yourself a great 30-minute meal. It's a classic fall and winter dish that can be made right on the stovetop.","preparation_time_minutes":30,"servings":{"min":4,"max":6},"steps":["Heat olive oil in a large stainless steel or cast-iron skillet over high heat until very lightly smoking. Immediately add squash, season with salt and pepper, and cook, stirring and tossing occasionally, until well-browned and squash is tender, about 5 minutes. Add butter and shallots and continue cooking, stirring frequently, until butter is lightly browned and smells nutty, about 1 minute longer. Add sage and stir to combine (sage should crackle and let off a great aroma). Remove from heat and stir in lemon juice. Set aside.","In a medium saucepan, combine pasta with enough room temperature or hot water to cover by about 2 inches. Season with salt. Set over high heat and bring to a boil while stirring frequently. Cook, stirring frequently, until pasta is just shy of al dente, about 2 minutes less than the package directions. Drain pasta, reserving a couple cups of the starchy cooking liquid.","Add pasta to skillet with squash along with a splash of pasta water. Bring to a simmer over high heat and cook until the pasta is perfectly al dente, stirring and tossing constantly and adding a splash of water as needed to keep the sauce loose and shiny. Off heat, stir in Parmigiano-Reggiano. Adjust seasoning with salt and pepper and texture with more pasta water as needed. Serve immediately, topped with more cheese at the table."],"ingredients":[{"name":"extra-virgin olive oil","amount":30,"unit":"ml"},{"name":"Butternut squash","amount":450,"unit":"grams"},{"name":"Kosher salt"},{"name":"Freshly ground black pepper"},{"name":"Unsalted butter","amount":30,"unit":"grams"},{"name":"Shallot","amount":1,"unit":"pcs"},{"name":"Fresh sage leaves","amount":15,"unit":"grams"},{"name":"Lemon juice","amount":15,"unit":"ml"},{"name":"Penne","amount":450,"unit":"grams"},{"name":"Grated fresh Parmigiano-Reggiano cheese","amount":30,"unit":"grams"}],"created":"2014-12-19T10:21:01Z","ratings":[3.0,4.0,3.5,2.0]}
{"index":{"_id":3}}
{"title":"Ricotta Gnocchi With Asparagus and Prosciutto","description":"Fresh ricotta gnocchi may be the fastest fresh-pasta recipe I know. With a little practice, I've gotten it down to under ten minutes (8 minutes 53 seconds, to be precise). But the great part about this recipe is that it serves as a suitable base for a huge variety of sauces and flavors. For instance, last week a friend of mine brought over some delicious first-of-the-season fresh asparagus which we combined with prosciutto and an easy cream sauce to make a delicious impromptu (and fast!) meal on the spot.","preparation_time_minutes":20,"servings":{"min":3,"max":4},"steps":["Set a large pot of salted water over high heat. Meanwhile, heat olive oil in a large skillet or slope-sided saucepan over medium-high heat until shimmering. Add prosciutto and cook, stirring, until mostly crisp, about 2 minutes. Add scallions and garlic and cook, stirring, until fragrant, about 1 minute. Add asparagus and cook, tossing and stirring frequently, until asparagus is just starting to turn tender, about 2 minutes.","Add heavy cream and half of Parmesan. Cook, stirring, until cream thickens and coats the asparagus pieces, about 4 minutes. Season to taste with salt and pepper.","Add gnocchi to now-boiling pot of water, stir gently, and cook until gnocchi float for 30 seconds, about 3 minutes total. Drain gnocchi, reserving 1/4 cup of pasta cooking water. Add gnocchi, lemon juice, half of lemon zest, chives, and 2 tablespoons of cooking water to saucepan with sauce and bring to a hard boil, stirring gently. Add more pasta water to thin sauce to desired consistency. Serve immediately, topped with lemon zest and additional Parmesan cheese."],"ingredients":[{"name":"Extra-virgin olive oil","amount":1,"unit":"tbsp"},{"name":"Thinly sliced prosciutto","amount":115,"unit":"grams"},{"name":"Thinly sliced green garlic","amount":0.25,"unit":"cups"},{"name":"Cloves garlic","amount":2,"unit":"pcs"},{"name":"Asparagus","amount":450,"unit":"grams"},{"name":"Heavy cream","amount":1,"unit":"cups"},{"name":"Grated Parmigiano-Reggiano cheese","amount":55,"unit":"grams"},{"name":"Kosher salt"},{"name":"Freshly ground black pepper"},{"name":"Lemon juice","amount":1,"unit":"tbsp"},{"name":"grated zest","amount":1,"unit":"tsp"},{"name":"Minced fresh chives","amount":2,"unit":"tbsp"},{"name":"Ricotta"}],"created":"2007-01-23T07:51:22Z","ratings":[5.0]}
{"index":{"_id":4}}
{"title":"Shrimp Fra Diavolo (Spaghetti With Spicy Tomato Sauce)","description":"Lobster fra diavolo is a classic Italian-American pasta dish, but the lobster version is a lot easier for restaurants than home cooks. Shrimp make an excellent stand-in, as long as you know how to infuse the spicy tomato sauce with some real shellfish flavor.","preparation_time_minutes":30,"servings":{"min":4,"max":4},"steps":["Bring a large pot of salted water to a boil. In a medium bowl, toss the shrimp well with the 1/2 teaspoon salt and the baking soda. Set aside.","In a large skillet or sauté pan, heat 4 tablespoons olive oil over medium-high heat until shimmering, Add reserved shrimp shells and cook, stirring constantly, until they've all turned a reddish color, about 4 minutes. Off the heat, remove the shells using tongs, a slotted spatula, and/or a slotted spoon, allowing any excess oil to drain back into skillet as you go; discard the shells. You should still have plenty of oil left in the skillet.","Return the skillet to medium-high heat, add the shrimp, and cook, stirring and turning occasionally, until shrimp are just starting to brown in spots and are almost fully cooked through, about 3 minutes. Off the heat, transfer shrimp to a plate and set aside.","Return the skillet to medium-low heat. Add garlic, oregano, and chili flakes and cook, stirring, until garlic is just beginning to turn golden, about 3 minutes. Add brandy, if using, and cook until almost fully evaporated. Add tomatoes and clam juice and bring to a simmer. Season with salt.","Boil the pasta in the pot of salted water until al dente. Drain, reserving about 1 cup of the pasta cooking water, and add pasta to the sauce along with a splash of the pasta cooking water. Add shrimp and cook over medium-high heat, stirring, until the sauce reduces and clings to pasta and the shrimp are fully heated through; add more pasta water as necessary if the sauce becomes too dry. Season with salt, if necessary.","Stir in parsley and remaining 2 tablespoons olive oil. Serve right away."],"ingredients":[{"name":"Kosher salt","amount":0.5,"unit":"tsp"},{"name":"Large shrimp","amount":340,"unit":"grams"},{"name":"Large pinch baking soda"},{"name":"Extra-virgin olive oil","amount":90,"unit":"ml"},{"name":"Cloves garlic","amount":4,"unit":"pcs"},{"name":"Dried oregano","amount":1.5,"unit":"tsp"},{"name":"Red chili flakes ","amount":1.5,"unit":"tsp"},{"name":"Brandy","amount":30,"unit":"ml"},{"name":"Whole peeled tomatoes","amount":800,"unit":"grams"},{"name":"Clam juice","amount":120,"unit":"ml"},{"name":"Spaghetti","amount":450,"unit":"grams"},{"name":"Minced flat-leaf parsley leaves","amount":0.25,"unit":"cups"}],"created":"2001-07-01T09:43:51Z","ratings":[1.5,3.0,3.5,2.0]}
{"index":{"_id":5}}
{"title":"Stovetop Macaroni and Cheese","description":"This macaroni and cheese — this pot of creamy, gooey, cheesy, glorious macaroni and cheese — was made with three ingredients in about 10 minutes. Seriously. That's one fewer ingredient than you need to add to the pot to make a box of Kraft macaroni and cheese. Not only that, but all three ingredients are staples, with shelf lives of weeks or months, which means that a simple lunch is always on hand.","preparation_time_minutes":8,"servings":{"min":2,"max":2},"steps":["Place macaroni in a medium saucepan or skillet and add just enough cold water to cover. Add a pinch of salt and bring to a boil over high heat, stirring frequently. Continue to cook, stirring, until water has been almost completely absorbed and macaroni is just shy of al dente, about 6 minutes.","Immediately add evaporated milk and bring to a boil. Add cheese. Reduce heat to low and cook, stirring continuously, until cheese is melted and liquid has reduced to a creamy sauce, about 2 minutes longer. Season to taste with more salt and serve immediately."],"ingredients":[{"name":"Elbow macaroni","amount":170,"unit":"grams"},{"name":"Evaporated milk","amount":180,"unit":"ml"},{"name":"Cheddar cheese","amount":170,"unit":"grams"}],"created":"2013-04-17T21:01:55Z","ratings":[5.0,5.0,4.5,5.0,4.0,5.0]}
{"index":{"_id":6}}
{"title":"Spaghetti Aglio e Olio Recipe","description":"One of the most basic pasta sauces, aglio e olio uses just garlic and olive oil (and maybe a pinch of red pepper flakes for heat). It sounds too simple to be good, but it's among the best.","preparation_time_minutes":10,"servings":{"min":4,"max":4},"steps":["In a pot of salted boiling water, cook spaghetti until just shy of al dente (about 1 minute less than the package directs). Reserve pasta cooking water.","Meanwhile, in a large skillet, combine 6 tablespoons oil and garlic. Add pinch of red pepper flakes, if using. Cook over medium heat until garlic is very lightly golden, about 5 minutes. (Adjust heat as necessary to keep it gently sizzling.)","Transfer pasta to skillet along with 1/2 cup pasta water, increase heat to high, and cook, stirring and tossing rapidly, until a creamy, emulsified sauce forms and coats the noodles. Remove from heat, add remaining 2 tablespoons olive oil, and stir well to combine. Mix in parsley, if using, and serve right away."],"ingredients":[{"name":"Kosher salt"},{"name":"Dried spaghetti","amount":450,"unit":"grams"},{"name":"Extra-virgin olive oil","amount":120,"unit":"ml"},{"name":"Cloves garlic","amount":4,"unit":"pcs"},{"name":"Red pepper flakes"},{"name":"Minced flat-leaf parsley"}],"created":"2016-09-23T22:34:00Z","ratings":[0.5,3.5,2.5,3.0,1.0,4.0]}
{"index":{"_id":7}}
{"title":"Cacio e Pepe (Spaghetti With Black Pepper and Pecorino Romano)","description":"If you were to watch a practiced hand make cacio e pepe, you might think the instructions were as simple as this: Cook spaghetti and drain. Toss with olive oil, butter, black pepper, and grated Pecorino Romano cheese. Serve. But we all know that the simplest recipes can often be the most confounding, and so it is with cacio e pepe. Follow those instructions and, if you're lucky, you'll get what you're after: a creamy, emulsified sauce that coats each strand of spaghetti with flavor. More likely, you're gonna get what I (and, from the stories I've heard, many others as well) got on the first few tries — spaghetti in a thin, greasy sauce, or spaghetti with clumps of cheese that refuse to melt. Or, worse, both at the same time. Here's how to make it perfectly every time.","preparation_time_minutes":15,"servings":{"min":2,"max":3},"steps":["Heat 3 tablespoons olive oil and about a teaspoon of black pepper in a medium skillet over medium-low heat until ingredients are fragrant and pepper is barely starting to sizzle, about 1 minute. Set aside.","Place spaghetti in a large skillet and cover with water. Season with a small pinch of salt, then bring to a boil over high heat, prodding spaghetti occasionally with a fork or wooden spoon to prevent it from clumping. Cook until spaghetti is al dente (typically about 1 minute less than the package recommends). Transfer 2 to 3 tablespoons of pasta cooking water to the skillet with the olive oil/pepper mixture. Stir in butter. Using tongs, lift spaghetti and transfer it to the oil/butter mixture.","Add cheese and remaining tablespoon olive oil to the skillet and stir with a fork until cheese is completely melted. Add a few more tablespoons of pasta water to the skillet to adjust consistency, reheating as necessary until the sauce is creamy and coats each strand of spaghetti. Season to taste with salt and more black pepper. Serve immediately, passing extra grated cheese and black pepper at the table."],"ingredients":[{"name":"Extra-virgin olive oil","amount":60,"unit":"ml"},{"name":"Coarsely ground black pepper"},{"name":"Kosher salt"},{"name":"Spaghetti","amount":225,"unit":"grams"},{"name":"Unsalted butter","amount":30,"unit":"grams"},{"name":"Pecorino Romano cheese","amount":55,"unit":"grams"}],"created":"2009-11-24T00:59:21Z","ratings":[4.0,3.0,4.5,3.5]}
{"index":{"_id":8}}
{"title":"Vegan Carbonara Pasta","description":"Carbonara may be one of the most difficult recipes to vegan-ify, since every major ingredient in the sauce is off-limits. But by eating lots of the real deal and getting mighty crafty with an array of unlikely ingredients, I managed to create a vegan carbonara that captures the essence of the original like no other: It's silky and rich, unctuous, and studded with meaty bits, with the sharp, lactic tang of Pecorino Romano (but, of course, no actual Pecorino Romano).","preparation_time_minutes":30,"servings":{"min":4,"max":4},"steps":["In a blender, combine tofu, sauerkraut brine, nutritional yeast, miso, cayenne or chili flakes, smoked paprika, black pepper, and vinegar or lemon juice. Blend at high speed, stopping to scrape down sides if necessary, until a very smooth, silky sauce forms. Season with salt. Add 1/4 cup (60ml) olive oil and blend in at low speed just until emulsified.","In a large sauté pan, heat remaining 1/4 cup (60ml) olive oil over medium-high heat until shimmering. Add mushrooms and cook, stirring, until browned, about 6 minutes.","In a pot of salted boiling water, cook pasta until just al dente. Transfer pasta to pan with mushrooms, reserving pasta-cooking water. Pour on just enough creamy sauce to coat all the pasta, then add about 1/4 cup (60ml) pasta-cooking water. Cook over medium heat, stirring, until sauce forms a silky glaze that coats pasta. Serve."],"ingredients":[{"name":"Silken tofu","amount":200,"unit":"grams"},{"name":"Sauerkraut brine","amount":120,"unit":"ml"},{"name":"Nutritional yeast","amount":15,"unit":"grams"},{"name":"White miso","amount":15,"unit":"ml"},{"name":"Cayenne pepper"},{"name":"Smoked paprika","amount":0.25,"unit":"tsp"},{"name":"Freshly ground black pepper","amount":2,"unit":"tsp"},{"name":"White wine vinegar","amount":1,"unit":"tsp"},{"name":"Kosher salt"},{"name":"Extra-virgin olive oil","amount":120,"unit":"ml"},{"name":"King oyster mushrooms","amount":115,"unit":"grams"},{"name":"Dry spaghetti or penne","amount":450,"unit":"grams"}],"created":"2002-01-04T12:55:42Z","ratings":[3.0,2.5,4.0,4.5,3.5,4.0]}
{"index":{"_id":9}}
{"title":"Bucatini all'Amatriciana","description":"Debate rages over the correct way to make a classic Roman amatriciana sauce of cured pork and tomatoes. We tested all the variables to come up with this ideal version, which packs a delicate heat, gentle black-pepper spice, sharp Pecorino Romano cheese, and the intriguing interplay of sweet-tart tomato sauce and rich, fatty cured pork.","preparation_time_minutes":20,"servings":{"min":4,"max":4},"steps":["In a large skillet, heat olive oil over medium-high heat until shimmering. Add guanciale and pepper flakes and cook, stirring, until lightly browned, about 5 minutes. Add wine and cook, scraping up any browned bits on bottom of pan, until nearly evaporated, about 3 minutes.","Add tomatoes and bring to a simmer. Season with salt and pepper.","Meanwhile, boil pasta in salted water until just shy of al dente, about 1 minute less than package recommends. Using tongs, transfer pasta to sauce, along with 1/4 cup pasta cooking water. Cook over high heat, stirring and tossing rapidly, until pasta is al dente and sauce has thickened and begins to coat noodles. Remove from heat, add cheese, and stir rapidly to incorporate. Season to taste with more salt and pepper. Serve right away, passing more cheese at the table."],"ingredients":[{"name":"Extra-virgin olive oil","amount":1,"unit":"tsp"},{"name":"Guanciale","amount":170,"unit":"grams"},{"name":"Pinch red pepper flakes"},{"name":"Dry white wine","amount":60,"unit":"ml"},{"name":"Can whole peeled tomatoes","amount":425,"unit":"grams"},{"name":"Kosher salt"},{"name":"Freshly ground black pepper"},{"name":"Dried bucatini pasta","amount":450,"unit":"grams"},{"name":"Grated Pecorino Romano cheese","amount":30,"unit":"grams"}],"created":"2016-09-24T16:51:22Z","ratings":[5.0,5.0,4.5,5.0,4.0,5.0,3.5,4.5]}
{"index":{"_id":10}}
{"title":"Penne With Hot-As-You-Dare Arrabbiata Sauce","description":"Exceedingly simple in concept and execution, arrabbiata sauce is tomato sauce with the distinction of being spicy enough to earn its \"angry\" moniker. Here's how to make it, from start to finish.","preparation_time_minutes":15,"servings":{"min":4,"max":4},"steps":["In a medium saucepan of boiling salted water, cook penne until just short of al dente, about 1 minute less than the package recommends.","Meanwhile, in a large skillet, combine oil, garlic, and pepper flakes. Cook over medium heat until garlic is very lightly golden, about 5 minutes. (Adjust heat as necessary to keep it gently sizzling.)","Add tomatoes, stir to combine, and bring to a bare simmer. When pasta is ready, transfer it to sauce using a strainer or slotted spoon. (Alternatively, drain pasta through a colander, reserving 1 cup of cooking water. Add drained pasta to sauce.)","Add about 1/4 cup pasta water to sauce and increase heat to bring pasta and sauce to a vigorous simmer. Cook, stirring and shaking the pan and adding more pasta water as necessary to keep sauce loose, until pasta is perfectly al dente, 1 to 2 minutes longer. (The pasta will cook more slowly in the sauce than it did in the water.)","Continue cooking pasta until sauce thickens and begins to coat noodles, then remove from heat and toss in cheese and parsley, stirring vigorously to incorporate. Stir in a drizzle of fresh olive oil, if desired. Season with salt and serve right away, passing more cheese at the table."],"ingredients":[{"name":"Kosher salt"},{"name":"Penne pasta","amount":450,"unit":"grams"},{"name":"Extra-virgin olive oil","amount":3,"unit":"tbsp"},{"name":"Clove garlic","amount":1,"unit":"pcs"},{"name":"Crushed red pepper"},{"name":"Can whole peeled tomatoes","amount":400,"unit":"grams"},{"name":"Finely grated Parmesan cheese","amount":60,"unit":"grams"},{"name":"Minced flat-leaf parsley leaves","amount":1,"unit":"handful"}],"created":"2017-04-27T15:14:52Z","ratings":[1.5,2.0,4.0,3.5,3.0,5.0,1.5]}
{"index":{"_id":11}}
{"title":"Spaghetti Puttanesca (Pasta or Spaghetti With Capers, Olives, and Anchovies)","description":"\"Puttanesca\" literally translates to \"in the style of prostitutes,\" supposedly because the pungent aromas of garlic, anchovies, capers, and olives tossed with pasta were how Neapolitan prostitutes would lead customers to their doors. This is one of those stories that seem, in the words of Douglas Adams, apocryphal or at least wildly inaccurate. That said, it's a fitting title — puttanesca packs an aromatic punch and then some.","preparation_time_minutes":15,"servings":{"min":2,"max":3},"steps":["Place spaghetti in a large skillet, sauté pan, or saucepan and cover with water. Add a small pinch of salt. Bring to a boil over high heat, stirring occasionally to prevent pasta from sticking.","Meanwhile, in a medium skillet, combine 4 tablespoons (60ml) oil, garlic, anchovies, and red pepper flakes. Cook over medium heat until garlic is very lightly golden, about 5 minutes. (Adjust heat as necessary to keep it gently sizzling.) Add capers and olives and stir to combine.","Add tomatoes, stir to combine, and bring to a bare simmer. Continue to simmer until pasta is cooked to just under al dente (about 1 minute less than the package recommends).","Using tongs, transfer pasta to sauce. Alternatively, drain pasta through a colander, reserving 1 cup of the cooking water. Add drained pasta to sauce.","Add a few tablespoons of pasta water to sauce and increase heat to bring pasta and sauce to a vigorous simmer. Cook, stirring and shaking the pan and adding more pasta water as necessary to keep sauce loose, until pasta is perfectly al dente, 1 to 2 minutes longer. (The pasta will cook more slowly in the sauce than it did in the water.) Stir in remaining olive oil, parsley, and cheese.","Season with salt and pepper. (Be generous with the pepper and scant with the salt — the dish will be plenty salty from the other ingredients.) If using, stir in canned tuna and break it up with a fork. Serve immediately with more grated cheese at the table."],"ingredients":[{"name":"Dried spaghetti","amount":225,"unit":"grams"},{"name":"Kosher salt"},{"name":"Extra-virgin olive oil","amount":6,"unit":"tbsp"},{"name":"Cloves garlic","amount":4,"unit":"pcs"},{"name":"Anchovy fillets","amount":5,"unit":"pcs"},{"name":"Large pinch red pepper flakes"},{"name":"Capers","amount":0.25,"unit":"cups"},{"name":"Pitted black olives","amount":0.25,"unit":"cups"},{"name":"Whole peeled tomatoes","amount":225,"unit":"grams"},{"name":"Minced fresh parsley leaves","amount":1,"unit":"handful"},{"name":"Finely grated Pecorino Romano or Parmesan cheese","amount":30,"unit":"grams"},{"name":"Freshly ground black pepper"},{"name":"Can oil-packed tuna","amount":140,"unit":"grams"}],"created":"2011-02-21T11:01:26Z","ratings":[0.5,1.0,0.5,1.5,2.0]}
{"index":{"_id":12}}
{"title":"Penne With Melted-Vegetable Sauce","description":"Made with vegetables that have been cooked until meltingly soft, this penne pasta dish is one of those great examples of what makes classic rustic Italian cooking so special: It makes the most of humble and unassuming ingredients, turning them into something downright delicious.","preparation_time_minutes":30,"servings":{"min":4,"max":4},"steps":["In a medium pot of salted boiling water, cook potato until a piece is easily crushed between fingers, about 5 minutes. Using fine strainer, transfer to large mixing bowl. Working one vegetable at a time, continue by boiling carrots, string beans, fennel, and onion until each is well done, about 5 minutes each; add each vegetable to mixing bowl as it is ready.","Add penne to boiling water and cook until al dente, following timing on package. Drain, reserving 1 cup of cooking water.","Meanwhile, add garlic, olive oil, and parsley to vegetables, and mix thoroughly until potatoes have broken down for form a chunky puree. Season with salt and pepper.","Add penne and a healthy grating of Parmigiano-Reggiano to vegetable sauce and stir to combine, adding cooking water 1 tablespoon at a time if sauce is too thick. Spoon into bowls, top with additional grated cheese, and serve."],"ingredients":[{"name":"Kosher salt"},{"name":"Large russet potato","amount":1,"unit":"pcs"},{"name":"Medium carrots","amount":2,"unit":"pcs"},{"name":"String beans","amount":85,"unit":"grams"},{"name":"Small fennel bulb","amount":0.5,"unit":"pcs"},{"name":"Small red onion","amount":1,"unit":"pcs"},{"name":"Dried penne","amount":450,"unit":"grams"},{"name":"Cloves garlic","amount":3,"unit":"pcs"},{"name":"Extra-virgin olive oil","amount":0.75,"unit":"cups"},{"name":"Minced parsley","amount":0.25,"unit":"cups"},{"name":"Freshly ground black pepper"},{"name":"Grated Parmigiano-Reggiano"}],"created":"2017-05-20T13:15:27Z","ratings":[4.0,4.5,4.0,3.5,3.5,3.0,4.0]}
{"index":{"_id":13}}
{"title":"Pesto Pasta With Potatoes and Green Beans","description":"This classic Genovese method of preparing pasta with pesto includes cubes of potato and pieces of green bean, all cooked together in the pasta pot until tender.","preparation_time_minutes":15,"servings":{"min":4,"max":4},"steps":["In a large pot of salted boiling water, boil pasta, potato, and green beans until pasta is al dente and potato and green beans are very tender. Drain, reserving 1 cup cooking water, and transfer pasta, potato, and green beans to a large mixing or serving bowl.","Add pesto sauce to pasta along with 1/4 cup pasta cooking water. Toss well to emulsify pesto and pasta water into a creamy sauce. Add more pasta water, 1 tablespoon at a time, as needed, if pasta is too dry. Drizzle in fresh olive oil, if desired. Serve with Parmigiano Reggiano on the side."],"ingredients":[{"name":"Kosher salt"},{"name":"Dried pasta","amount":450,"unit":"grams"},{"name":"Peeled Yukon Gold potato","amount":140,"unit":"grams"},{"name":"Green beans","amount":110,"unit":"grams"},{"name":"Pesto sauce"},{"name":"Extra-virgin olive oil"},{"name":"Grated Parmigiano Reggiano"}],"created":"2010-12-21T08:52:29Z","ratings":[]}
{"index":{"_id":14}}
{"title":"Lighter Fettuccine Alfredo Recipe","description":"Don't get me wrong — I'm not a health nut or a calorie counter. But let's face it: The feeling you get after downing a bowl of creamy, cheesy fettuccine Alfredo ain't the best. Wouldn't it be great to have a quick and easy version that's just as good as the typical cream-packed rendition, but has a cleaner flavor and doesn't leave you in a food coma?","preparation_time_minutes":30,"servings":{"min":4,"max":4},"steps":["Combine cheese, heavy cream, egg, cornstarch, olive oil, and lemon zest (if using) in a large bowl. Season lightly with salt and heavily with black pepper and whisk to combine. Set aside.","In a large Dutch oven or saucepan, bring 2 quarts of water and 2 tablespoons (24g) of salt to a boil over high heat. Add pasta and cook, stirring frequently to prevent sticking, until cooked but still very firm (not quite al dente), about 45 seconds for fresh pasta or 1 minute less than package directions indicate for dried pasta. Drain pasta into a colander set over a large bowl. Transfer 2 cups (480ml) of cooking water to a liquid measuring cup and discard the rest. Transfer pasta to the now-empty bowl. Add garlic and butter and toss to coat.","Whisking constantly, slowly add 1 1/2 cups of pasta cooking water to bowl with cheese mixture. Transfer cheese mixture to the now-empty pasta cooking pot, scraping the bottom to make sure you get everything. Cook over medium-high heat, stirring constantly with a rubber spatula, until mixture comes to a boil and thickens, about 45 seconds. Season sauce to taste with more salt and pepper as desired. Transfer pasta to sauce mixture and turn to coat. Just before serving, stir in more pasta water to thin sauce out as necessary. Serve immediately, sprinkled with minced herbs, black pepper, and cheese, and drizzled with additional olive oil."],"ingredients":[{"name":"Grated Parmigiano Reggiano cheese","amount":140,"unit":"grams"},{"name":"Heavy cream","amount":30,"unit":"ml"},{"name":"Egg","amount":1,"unit":"pcs"},{"name":"Cornstarch","amount":1,"unit":"tsp"},{"name":"Extra-virgin olive oil","amount":2,"unit":"tbsp"},{"name":"Grated lemon zest","amount":0.5,"unit":"tsp"},{"name":"Kosher salt"},{"name":"Freshly ground black pepper"},{"name":"Fresh fettuccine","amount":450,"unit":"grams"},{"name":"Minced garlic","amount":1,"unit":"tsp"},{"name":"Unsalted butter","amount":30,"unit":"grams"},{"name":"Minced fresh parsley"}],"created":"2008-06-04T14:13:56Z","ratings":[4.0]}
{"index":{"_id":15}}
{"title":"Lighter Tuna Noodle Casserole","description":"Pasta with a light and creamy sauce, tender chunks of tuna, and peas is ready in about 15 minutes start to finish. This is the kind of recipe that I wish I'd known in college. All it takes is a single large skillet or pot, one burner or hot plate, a bowl, and a fork. That's it. And on top of that, it turns out a dish that's not just good-given-the-constraints, but legitimately good-enough-that-I-would've-made-it-for-that-girl-I-was-trying-to-impress-in-college or even good-enough-for-a-mildly-romantic-weeknight-dinner-with-the-wife.","preparation_time_minutes":15,"servings":{"min":4,"max":4},"steps":["Place noodles in a large saucepan or skillet and cover with room temperature tap water by 1 inch. Season lightly with salt. Bring to a boil over high heat and cook, stirring occasionally, until almost done (follow package directions for cook times). Drain all but 1 cup of water. Return to high heat and simmer until water is almost completely reduced.","Meanwhile, combine créme fraiche, egg, cornstarch, and 1 tablespoon lemon juice in a medium bowl and whisk with a fork or whisk until homogenous.","When noodles are cooked, add créme fraiche mixture to skillet and cook, stirring and tossing constantly, until sauce thickens and coats noodles. Season generously with black pepper and salt. Off heat, gently fold in tuna, peas, parsley, and remaining lemon juice until warmed through. Serve immediately drizzled with extra-virgin olive oil and sprinkled with crushed potato chips, if desired."],"ingredients":[{"name":"Dried wide egg noodles","amount":170,"unit":"grams"},{"name":"Kosher salt"},{"name":"Créme fraiche","amount":170,"unit":"grams"},{"name":"Egg","amount":1,"unit":"pcs"},{"name":"Cornstarch","amount":2,"unit":"tsp"},{"name":"Freshly ground black pepper"},{"name":"Lemon juice","amount":2,"unit":"tbsp"},{"name":"Tuna","amount":1,"unit":"cans"},{"name":"Frozen peas","amount":1,"unit":"cups"},{"name":"Picked fresh parsley leaves","amount":0.25,"unit":"cups"},{"name":"Extra-virgin olive oil"},{"name":"Crushed potato chips"}],"created":"2010-08-21T12:51:36Z","ratings":[4.5,3.5]}
{"index":{"_id":16}}
{"title":"One-Skillet Orecchiette With Shrimp, Spinach, and Mushrooms","description":"Earthy, meaty mushrooms, tender shrimp, and silky strands of spinach are the stars of this easy, one-pot pasta dish. A perfect choice for a weeknight dinner, this recipe comes together in less than 30 minutes and makes minimal mess as the action occurs in a single pan.","preparation_time_minutes":25,"servings":{"min":4,"max":4},"steps":["Heat 1 tablespoon olive oil in a pot or 12-inch skillet over medium-high heat until shimmering. Add mushrooms, season with salt, and cook until golden brown, about 3 minutes. Set aside.","In the same pot, add the remaining 1 tablespoon oil and cook until shimmering. Add shallot and a pinch of salt and cook until softened, about 2 minutes. Add garlic and chili flakes and cook until fragrant, about 30 seconds. Then add white wine, scraping up any brown bits in the pan and allow it to reduce slightly, about 1 minute.","Add the pasta and stock, season with salt and bring to a boil. Cook orecchiette, stirring occasionally, until the broth is mostly absorbed and the pasta is al dente, about 10 minutes.","Stir in the spinach and shrimp and cook until the spinach is wilted and the shrimp are pink throughout, about 3 minutes. Stir in the mushrooms and lemon juice, and season with salt and pepper. Serve immediately."],"ingredients":[{"name":"Extra-virgin olive oil","amount":2,"unit":"tbsp"},{"name":"Oyster mushrooms","amount":2,"unit":"cups"},{"name":"Kosher salt"},{"name":"Freshly ground black pepper"},{"name":"Shallot","amount":1,"unit":"pcs"},{"name":"Cloves garlic","amount":2,"unit":"pcs"},{"name":"Dried red chili flakes"},{"name":"Dry white wine","amount":0.25,"unit":"cups"},{"name":"Dried orecchiette","amount":450,"unit":"grams"},{"name":"Homemade chicken stock","amount":950,"unit":"ml"},{"name":"Spinach","amount":2,"unit":"cups"},{"name":"Medium shrimp","amount":450,"unit":"grams"},{"name":"Lemon juice","amount":2,"unit":"tbsp"}],"created":"2005-07-30T09:31:01Z","ratings":[]}
{"index":{"_id":17}}
{"title":"Skillet Pasta With Mushrooms, Pancetta, and Wilted Greens","description":"This easy one-pot pasta dish is filled with browned bits of pancetta, earthy Shiitake mushrooms and wilted greens, and comes together in just 25 minutes. Finished with nutty shavings of Parmesan and freshly cracked black pepper, it's a perfect weeknight meal.","preparation_time_minutes":30,"servings":{"min":4,"max":4},"steps":["Heat oil in a large saucepan over medium-high heat until shimmering. Add pancetta and cook until fat begins to render and pancetta is lightly browned, about 2 minutes. Stir in mushrooms, tossing until coated with oil. Cook, stirring, until mushrooms have browned and pancetta has rendered most of its fat, about 5 minutes longer. Stir in shallots and serrano and cook until softened, about 1 minute. Remove from heat and scrape pancetta mixture into a bowl. Set aside.","Add stock to now-empty saucepan and bring to a boil over high heat. Add pasta. Cook pasta, stirring occasionally, for 2 minutes less than package instructions, then stir in greens. Cook for 1 minute longer, then stir in pancetta mixture, along with all the rendered fat. Cook until the pasta is al dente, greens are wilted, and liquid has mostly evaporated and formed an emulsified, creamy sauce, about 1 minute (if necessary, add water a tablespoon at a time if liquid completely evaporates before pasta is tender).","Remove from heat and stir in lemon juice and extra-virgin olive oil. Season to taste with salt and pepper. Spoon onto plates and top with Parmesan cheese. Serve immediately."],"ingredients":[{"name":"Extra-virgin olive oil","amount":0.5,"unit":"tbsp"},{"name":"Panchetta","amount":115,"unit":"grams"},{"name":"Shiitake mushrooms","amount":2,"unit":"cups"},{"name":"Shallot","amount":1,"unit":"pcs"},{"name":"Serrano chile pepper","amount":0.5,"unit":"pcs"},{"name":"Homemade chicken or vegetable stock","amount":5,"unit":"cups"},{"name":"Dried fusilli","amount":450,"unit":"grams"},{"name":"Kosher salt"},{"name":"Freshly ground black pepper"},{"name":"Fresh lemon juice","amount":2,"unit":"tbsp"},{"name":"Greens (e.g. kale)","amount":2,"unit":"handful"},{"name":"Parmesan"}],"created":"2014-03-03T17:21:08Z","ratings":[5.0,1.5,3.0,4.5]}
{"index":{"_id":18}}
{"title":"Vegetarian Citrus Pasta With Swiss Chard","description":"Sumac is a Middle Eastern spice that has a tart lemony flavor. You can find it in specialty shops or order it online. I used whole wheat fusilli, which required about a half cup more liquid than regular pasta and adds a denser mouthfeel to the dish. You can use regular as well — just decrease the cooking liquid by 1/2 cup.","preparation_time_minutes":20,"servings":{"min":4,"max":4},"steps":["Heat the oil in a 12-inch skillet over medium-high heat until shimmering. Add the chard stems and season with salt and cook until they begin to soften, about 3 minutes. Add the shallots and cook until they have softened, adding another pinch of salt and the red chile flakes, about 2 minutes.","Add the stock to the pan with the fusilli and adjust the heat to maintain a vigorous boil and cook according to the package directions until the pasta has about 4 minutes left in the cooking process. Then, stir in the chard leaves and cook until the pasta and chard are done. Stir in the lemon juice and zest and adjust the seasoning as needed. Divide among plates, sprinkle with the sumac and freshly grated cheese."],"ingredients":[{"name":"Olive oil","amount":2,"unit":"tbsp"},{"name":"Swiss chard","amount":3,"unit":"handful"},{"name":"Large shallot","amount":1,"unit":"pcs"},{"name":"Kosher salt"},{"name":"Freshly ground black pepper"},{"name":"Dried red chile flakes"},{"name":"Homemade vegetable stock","amount":4.5,"unit":"cups"},{"name":"Whole wheat fusilli pasta","amount":450,"unit":"grams"},{"name":"Fresh lemon juice","amount":2,"unit":"tbsp"},{"name":"Sumac","amount":1,"unit":"tbsp"},{"name":"Parmigiano-Reggiano"}],"created":"2007-10-29T09:12:52Z","ratings":[5.0,5.0,4.5,3.0,2.5,4.0,4.5,3.5,4.0]}
{"index":{"_id":19}}
{"title":"Pasta With Mushrooms, Brussels Sprouts, and Parmesan","description":"A quick dinner of orecchiette pasta tossed in a clingy sauce made with mushrooms, shallots, thyme, and brussels sprouts leaves.","preparation_time_minutes":25,"servings":{"min":4,"max":4},"steps":["Bring a medium pot of salted water to a boil. Heat 1 tablespoon olive oil in a large skillet over high heat until smoking. Add brussels sprouts, toss to coat in oil, season with salt and pepper, cook without moving until well charred on one side. Toss and continue to cook until leaves are bright green and charred in spots, about 2 minutes total. Transfer to a bowl and set aside.","Heat remaining 2 tablespoons oil in the same skillet over high heat until lightly smoking. Add mushrooms and cook, tossing occasionally, until moisture has been evaporated and the mushrooms are well browned, about 4 minutes. Add shallots, garlic, and thyme and cook, stirring, until shallots are softened and fragrant, about 1 minute. Add butter, lemon juice, and stock. Simmer until sauce is reduced and emulsified, about 1 minute. Season to taste with salt and pepper (this may not be necessary if stock is store-bought). Set aside off heat.","Add orecchiette to pot and cook, stirring occasionally, until nearly al dente (about 1 minute less than the package instructions). Drain, reserving 1/2 cup cooking water. Add orecchiette, half of Parmesan, reserved pasta cooking water, and a generous amount of black pepper to mushrooms. Cook, stirring, over high heat until pasta is fully al dente and liquid has thickened into a sauce that coats the pasta, about 1 minute. If sauce looks greasy or broken, add 2 tablespoons of stock or water and stir vigorously to bring it back together. Stir in brussels sprouts leaves and serve, topping with more cheese at the table."],"ingredients":[{"name":"Olive oil","amount":3,"unit":"tbsp"},{"name":"Brussels sprouts","amount":115,"unit":"grams"},{"name":"Kosher salt"},{"name":"Freshly ground black pepper"},{"name":"Mixed mushrooms","amount":225,"unit":"grams"},{"name":"Shallot","amount":1,"unit":"pcs"},{"name":"Cloves garlic","amount":2,"unit":"pcs"},{"name":"Fresh thyme leaves","amount":1,"unit":"tsp"},{"name":"Butter","amount":4,"unit":"tbsp"},{"name":"Freshly squeezed lemon juice","amount":2,"unit":"tsp"},{"name":"Homemade vegetable or chicken stock","amount":0.5,"unit":"cups"},{"name":"Dried orecchiette","amount":450,"unit":"grams"},{"name":"Freshly grated Parmesan cheese","amount":55,"unit":"grams"}],"created":"2015-02-14T11:01:52Z","ratings":[3.5,4.0,3.5,3.0,4.5,4.0]}
{"index":{"_id":20}}
{"title":"Easy Skillet Baked Ziti With Sausage and Ricotta","description":"Nothing says comfort like a baked pasta dish loaded with creamy sauce and cheese. If my full-fledged No-Boil Baked Ziti is the completist, Super Mario 3 version of the dish, this week's skillet ziti is like using the magic whistle to jump straight to World 8. Not quite as satisfying, but a great alternative if time is of the essence.","preparation_time_minutes":30,"servings":{"min":6,"max":8},"steps":["Place pasta in a large bowl and cover with hot water. Season generously with salt. Let rest, stirring twice during the first 10 minutes, while you prepare the other ingredients.","Use a hand blender or countertop blender to process tomatoes until mostly smooth, but still a little chunky. Set aside 3/4 cup of tomatoes. Combine remaining tomatoes, heavy cream, and chicken stock in a medium bowl. Season to taste with salt and set aside.","Heat oil and butter in a large straight-sided sauté pan or Dutch oven over medium-high heat, swirling, until butter is mostly melted. Add sausage and cook, mashing with a potato masher or a whisk, until sausage is no longer pink, about 5 minutes. Add onion and garlic, reduce heat to medium, and cook, stirring frequently, until softened but not browned, about 5 minutes. Add oregano, red pepper flakes, and half of parsley and cook, stirring, until fragrant, about 1 minute.","Add tomato and cream mixture to pan with sausage. Drain noodles in a large colander set in the sink, then add to pan and stir to combine. Stir in half of ricotta, then rapidly stir in half of mozzarella cheese. (Do not over-stir, or the mixture will stretch and stick to your spoon.) Spoon reserved 3/4 cup tomatoes over top of pasta. Dollop with remaining ricotta and scatter remaining mozzarella over top. Sprinkle with half of Parmigiano-Reggiano. Cover and cook over the lowest possible heat for 3 minutes. Remove from heat and let rest, covered, for 5 minutes.","Uncover, sprinkle with remaining Parmigiano-Reggiano and parsley, and serve immediately."],"ingredients":[{"name":"Dry ziti or penne","amount":450,"unit":"grams"},{"name":"Kosher salt"},{"name":"Whole peeled tomatoes","amount":1,"unit":"cans"},{"name":"Heavy cream","amount":1,"unit":"cups"},{"name":"Homemade chicken stock","amount":1,"unit":"cups"},{"name":"Extra-virgin olive oil","amount":2,"unit":"tbsp"},{"name":"Unsalted butter","amount":2,"unit":"tbsp"},{"name":"Italian sausage","amount":450,"unit":"grams"},{"name":"Large onion","amount":1,"unit":"pcs"},{"name":"Cloves garlic","amount":4,"unit":"pcs"},{"name":"Dried oregano","amount":1,"unit":"tbsp"},{"name":"Crushed red pepper flakes","amount":1,"unit":"tsp"},{"name":"Finely minced fresh parsley leaves","amount":0.25,"unit":"cups"},{"name":"Ricotta cheese","amount":350,"unit":"grams"},{"name":"Low-moisture whole-milk mozzarella cheese","amount":450,"unit":"grams"},{"name":"Roughly grated Parmigiano-Reggiano","amount":85,"unit":"grams"}],"created":"2016-01-29T14:21:01Z","ratings":[3.0]}
{"index":{"_id":21}}
{"title":"Crispy Baked Pasta With Mushrooms, Sausage, and Parmesan Cream Sauce","description":"This recipe starts off with crumbled Italian sausage cooked down in a bit of butter. I sauté a few types of mushrooms in the rendered fat, then flavor them with shallots, garlic, and a little bit of soy sauce and lemon juice (this helps bring out their savoriness while also lightening them up). They get finished in a simple creamy sauce flavored with Parmesan cheese. Add some pasta, top it all of with crisp bread crumbs, bake it directly in the cast iron pan you cooked it in, and you've got yourself a one-skillet meal fit for normal everyday folks who perhaps might occasionally feel like kings.","preparation_time_minutes":30,"servings":{"min":4,"max":6},"steps":["Bring a large pot of salted water to a boil and keep at a bare simmer. Combine bread crumbs, 2 ounces cheese, half of parsley, half of chives, 1/4 of shallots, 1/4 of garlic, and olive oil in a medium bowl and massage with hands until combined. Season to taste with salt and pepper.","Melt butter in a large cast iron skillet over medium-high heat until foaming. Add sausage and cook, mashing it with a potato masher or a wooden spoon until broken up and well browned, about 7 minutes. Use a slotted spoon to transfer sausage to a small bowl, leaving fat behind.","Increase heat to high, add mushrooms to skillet, and cook, stirring frequently, until moisture has evaporated and mushrooms are well-browned, about 10 minutes. Add shallots and garlic and cook, stirring, until fragrant, about 30 seconds. Add soy sauce and lemon juice and stir to combine.","Add flour and cook, stirring, until a thin film begins to form on the bottom of the pan, about 1 minute. Slowly whisk in chicken broth followed by heavy cream. Bring to a simmer and cook until thickened, about 2 minutes. Stir in remaining grated cheese until melted. Stir in remaining parsley and chives. Stir in sausage. Season to taste with salt and lots of black pepper.","Adjust rack to 10 inches below broiler element and preheat broiler to high. Cook pasta in salted water according to package directions, removing it when still just shy of al dente. Drain, reserving 1 cup of cooking liquid. Return to pot. Add mushroom mixture and stir to combine, adding liquid to adjust consistency. Pasta should be very loose but not soupy. Return to cast iron skillet and top with bread crumbs. Broil until golden brown, rotating pan as necessary, 2 to 3 minutes. Serve immediately."],"ingredients":[{"name":"Panko-style bread crumbs","amount":1,"unit":"cups"},{"name":"Grated Parmesan cheese","amount":175,"unit":"grams"},{"name":"Chopped fresh parsley leaves","amount":0.25,"unit":"cups"},{"name":"Finely minced fresh chives","amount":2,"unit":"tbsp"},{"name":"Shallots","amount":2,"unit":"pcs"},{"name":"Cloves garlic","amount":2,"unit":"pcs"},{"name":"Extra-virgin olive oil","amount":2,"unit":"tbsp"},{"name":"Kosher salt"},{"name":"Freshly ground black pepper"},{"name":"Unsalted butter","amount":2,"unit":"tbsp"},{"name":"Italian sausage","amount":225,"unit":"grams"},{"name":"Mixed mushrooms","amount":450,"unit":"grams"},{"name":"Soy sauce","amount":1,"unit":"tbsp"},{"name":"Fresh lemon juice","amount":1,"unit":"tbsp"},{"name":"Flour","amount":2.5,"unit":"tbsp"},{"name":"Homemade chicken stock","amount":2,"unit":"cups"},{"name":"Heavy cream","amount":1,"unit":"cups"},{"name":"Fresh ridged pasta","amount":350,"unit":"grams"}],"created":"2002-10-21T15:07:53Z","ratings":[4.0,3.5]}
